frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32F0xx/APM32F071.svd
                <register>
                    <name>CHCFG5</name>
                    <displayName>CHCFG5</displayName>
                    <description>DMA channel 5 configuration register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCINTEN</name>
                            <description>Transfer complete interrupt
enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTINTEN</name>
                            <description>Half Transfer interrupt
enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRINTEN</name>
                            <description>Transfer error interrupt
enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRMODE</name>
                            <description>Circular mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIMODE</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIMODE</name>
                            <description>Memory increment mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZE</name>
                            <description>Peripheral size</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MSIZE</name>
                            <description>Memory size</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CHPL</name>
                            <description>Channel Priority level</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>M2MMODE</name>
                            <description>Memory to memory mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHNDATA5</name>
                    <displayName>CHNDATA5</displayName>
                    <description>DMA channel 5 number of data
register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATAT</name>
                            <description>Number of data to transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHPADDR5</name>
                    <displayName>CHPADDR5</displayName>
                    <description>DMA channel 5 peripheral address
register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMADDR5</name>
                    <displayName>CHMADDR5</displayName>
                    <description>DMA channel 5 memory address
register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MEMADDR</name>
                            <description>Memory address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCFG6</name>
                    <displayName>CHCFG6</displayName>
                    <description>DMA channel 6 configuration register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCINTEN</name>
                            <description>Transfer complete interrupt
enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTINTEN</name>
                            <description>Half Transfer interrupt
enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRINTEN</name>
                            <description>Transfer error interrupt
enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRMODE</name>
                            <description>Circular mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIMODE</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIMODE</name>
                            <description>Memory increment mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZE</name>
                            <description>Peripheral size</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MSIZE</name>
                            <description>Memory size</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CHPL</name>
                            <description>Channel Priority level</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>M2MMODE</name>
                            <description>Memory to memory mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHNDATA6</name>
                    <displayName>CHNDATA6</displayName>
                    <description>DMA channel 6 number of data
register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATAT</name>
                            <description>Number of data to transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHPADDR6</name>
                    <displayName>CHPADDR6</displayName>
                    <description>DMA channel 6 peripheral address
register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMADDR6</name>
                    <displayName>CHMADDR6</displayName>
                    <description>DMA channel 6 memory address
register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MEMADDR</name>
                            <description>Memory address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCFG7</name>
                    <displayName>CHCFG7</displayName>
                    <description>DMA channel 7 configuration register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCINTEN</name>
                            <description>Transfer complete interrupt
enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTINTEN</name>
                            <description>Half Transfer interrupt
enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRINTEN</name>
                            <description>Transfer error interrupt
enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRMODE</name>
                            <description>Circular mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIMODE</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIMODE</name>
                            <description>Memory increment mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZE</name>
                            <description>Peripheral size</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MSIZE</name>
                            <description>Memory size</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CHPL</name>
                            <description>Channel Priority level</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>M2MMODE</name>
                            <description>Memory to memory mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHNDATA7</name>
                    <displayName>CHNDATA7</displayName>
                    <description>DMA channel 7 number of data
register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATAT</name>
                            <description>Number of data to transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHPADDR7</name>
                    <displayName>CHPADDR7</displayName>
                    <description>DMA channel 7 peripheral address
register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PERADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHMADDR7</name>
                    <displayName>CHMADDR7</displayName>
                    <description>DMA channel 7 memory address
register</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MEMADDR</name>
                            <description>Memory address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
