frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32F0xx/APM32F071.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TSC</name>
            <description>Touch sensing controller</description>
            <groupName>TSC</groupName>
            <baseAddress>0x40024000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TSC</name>
                <description>Touch sensing interrupt</description>
                <value>8</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTPHSEL</name>
                            <description>Charge transfer pulse high</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CTPLSEL</name>
                            <description>Charge transfer pulse low</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SSERRVSEL</name>
                            <description>Spread spectrum deviation</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>SSEN</name>
                            <description>Spread spectrum enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSCDFSEL</name>
                            <description>Spread spectrum prescaler</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PGCDFSEL</name>
                            <description>pulse generator prescaler</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCNTVSEL</name>
                            <description>Max count error value</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>IODEFCFG</name>
                            <description>I/O Default mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCPOL</name>
                            <description>Synchronization pin
polarity</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AMCFG</name>
                            <description>Acquisition mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STARTAFLG</name>
                            <description>Start a new acquisition</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSCEN</name>
                            <description>Touch sensing controller
enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>interrupt enable register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCEIEN</name>
                            <description>Max count error interrupt
enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOAIEN</name>
                            <description>End of acquisition interrupt
enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTFCLR</name>
                    <displayName>INTFCLR</displayName>
                    <description>interrupt clear register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCEICLR</name>
                            <description>Max count error interrupt
clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOAICLR</name>
                            <description>End of acquisition interrupt
clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSTS</name>
                    <displayName>INTSTS</displayName>
                    <description>interrupt status register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCEFLG</name>
                            <description>Max count error flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOAFLG</name>
                            <description>End of acquisition flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOHCTRL</name>
                    <displayName>IOHCTRL</displayName>
                    <description>I/O hysteresis control
register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>G6P4</name>
                            <description>G6P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P3</name>
                            <description>G6P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P2</name>
                            <description>G6P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P1</name>
                            <description>G6P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P4</name>
                            <description>G5P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P3</name>
                            <description>G5P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P2</name>
                            <description>G5P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P1</name>
                            <description>G5P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P4</name>
                            <description>G4P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P3</name>
                            <description>G4P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P2</name>
                            <description>G4P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P1</name>
                            <description>G4P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P4</name>
                            <description>G3P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P3</name>
                            <description>G3P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P2</name>
                            <description>G3P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P1</name>
                            <description>G3P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P4</name>
                            <description>G2P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P3</name>
                            <description>G2P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P2</name>
                            <description>G2P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P1</name>
                            <description>G2P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P4</name>
                            <description>G1P4 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P3</name>
                            <description>G1P3 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P2</name>
                            <description>G1P2 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P1</name>
                            <description>G1P1 Schmitt trigger hysteresis
mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOASWCTRL</name>
                    <displayName>IOASWCTRL</displayName>
                    <description>I/O analog switch control
register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>G6P4</name>
                            <description>G6P4 analog switch enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P3</name>
                            <description>G6P3 analog switch enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P2</name>
                            <description>G6P2 analog switch enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G6P1</name>
                            <description>G6P1 analog switch enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P4</name>
                            <description>G5P4 analog switch enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P3</name>
                            <description>G5P3 analog switch enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P2</name>
                            <description>G5P2 analog switch enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G5P1</name>
                            <description>G5P1 analog switch enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P4</name>
                            <description>G4P4 analog switch enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P3</name>
                            <description>G4P3 analog switch enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P2</name>
                            <description>G4P2 analog switch enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G4P1</name>
                            <description>G4P1 analog switch enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P4</name>
                            <description>G3P4 analog switch enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P3</name>
                            <description>G3P3 analog switch enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P2</name>
                            <description>G3P2 analog switch enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G3P1</name>
                            <description>G3P1 analog switch enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P4</name>
                            <description>G2P4 analog switch enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P3</name>
                            <description>G2P3 analog switch enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P2</name>
                            <description>G2P2 analog switch enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G2P1</name>
                            <description>G2P1 analog switch enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P4</name>
                            <description>G1P4 analog switch enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P3</name>
                            <description>G1P3 analog switch enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P2</name>
                            <description>G1P2 analog switch enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>G1P1</name>
                            <description>G1P1 analog switch enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
